chat_system_2946755_actor_description=King Mark. Your King.
chat_system_2946755_snap_2_question=^?^And now, go to search for the stolen Plugens. You are to consider them an important treasure of Darion.
chat_system_2946755_snap_2_answer_0=^?^I'd like to clarify, what is it I'm looking for? - What are Plugens?
chat_system_2946755_snap_2_answer_1=^?^I'll find them, Your Majesty!
chat_system_2946755_snap_1_question=^?^It's very simple. We have replaced the old tax system by Plugens, special tokens made of precious metal. Every citizen buys a certain number of Plugens from us annually.<br>Plugens are a symbol of honesty and loyalty to Darion. They give the people the right to elect a mayor, or be granted a loan, even place their sons in court, or evade prison by receiving a royal pardon. Thus, all the right-minded people receive the protection of the crown, and the sale of these Plugens assures that the kingdom's treasury remains full!
chat_system_2946755_snap_1_answer_0=^?^Excellent idea! Thank you for the explanation.
chat_system_2946755_plugen_start_question=^?^I do hope, [player], that you have brought us good news, and a bag full of Plugens?
chat_system_2946755_plugen_start_answer_0=^?^I've found all the Plugens and punished the robbers, Your Majesty!
chat_system_2946755_plugen_start_answer_1=^?^I'd like to clarify, what is it I'm looking for? - What are Plugens?
chat_system_2946755_snap_0_question=^?^Not bad, [player]. I think you shall be an excellent Treasure Searcher.<br>[reward]
chat_system_2946755_snap_0_answer_0=^?^Yes, I had to run all over in search of them, and it hasn't been easy.
